# Electrical Per Phase Data Properties

Source: https://www.revitapidocs.com/2026/3f0d82a7-e672-e99f-74cc-ce5f7d178cdf.htm

---

| Electrical Per Phase Data Properties |
| --- |

The ElectricalPerPhaseData type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | CurrentPhaseA | The effective value of current on electrical phase A. |
|  | CurrentPhaseB | The effective value of current on electrical phase B. |
|  | CurrentPhaseC | The effective value of current on electrical phase C. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

Top See Also

#### Reference

ElectricalPerPhaseData Class Autodesk.Revit.DB.Electrical Namespace